<?php

namespace app\common\validate;


use think\Validate;
/**
 * ============================================================================
 * 爱购商城
 * ============================================================================
 * 版权所有 2020 爱购商城，并保留所有权利。
 * 网站地址: http://xbyshopp.stablenewpay.com
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用 .
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * 验证器
 */
class  Sellermoney extends Validate
{
    protected $rule = [
        'pdc_amount'=>'require|float|min:0.01'
    ];
    protected $message = [
        'pdc_amount.require'=>'请填写取出金额|取出金额必须是数字|0.01',
        'pdc_amount.float'=>'请填写取出金额|取出金额必须是数字|0.01',
        'pdc_amount.min'=>'请填写取出金额|取出金额必须是数字|0.01'
    ];
    protected $scene = [
        'withdraw_add' => ['pdc_amount'],
    ];
}